---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutOfBoundsWarn
source: html/04122bd2-195a-44b4-4e2f-e3ff6bc99984.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOutOfBoundsWarn Property

Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridlinesOutOfBoundsWarn { get; }
```